<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d905b34e558f5f72b3e38c38fed0d348cea2620ee732750fdfe567cc36f33827","plan_job_ref":"Job Plan Airflow DAGs #392 at https://github.com/cal-itp/data-infra/actions/runs/16532920944","plan_out_hash":"e4991260b421f0eed6adf0a3836ae16c257940ad9e118c24d4b310a2c64a8b6c","plan_hash":"2a213bd069fb22d88eef89acec31da0d4b40726e4018949a8d5edfedb402ee0b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 4 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9LeAwg==" -> (known after apply)
!~      detect_md5hash      = "seFuhO6op83J90oCixwTxQ==" -> "different hash"
!~      generation          = 1753406559845657 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "seFuhO6op83J90oCixwTxQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals_week.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals_week.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals_week.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_updates_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "eWGSiA==" -> (known after apply)
!~      detect_md5hash      = "8jwjpn0Pk2/uLqB39SiyuA==" -> "different hash"
!~      generation          = 1751416667308323 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_updates_metrics.sql"
!~      md5hash             = "8jwjpn0Pk2/uLqB39SiyuA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_updates_metrics_week.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "rzApeQ==" -> (known after apply)
!~      detect_md5hash      = "pH4yCnkRIu+Mm04v3bpUvQ==" -> "different hash"
!~      generation          = 1752799242909644 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_updates_metrics_week.sql"
!~      md5hash             = "pH4yCnkRIu+Mm04v3bpUvQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_metrics_week.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql"] will be destroyed
  # (because key ["models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "KUTqNQ==" -> null
-       detect_md5hash      = "9wrOmEZWRsOFGmKybMhCmg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416662934979 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql" -> null
-       md5hash             = "9wrOmEZWRsOFGmKybMhCmg==" -> null
-       md5hexhash          = "f70ace98465646c3851a62b26cc8429a" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2Ffct_stop_time_updates_with_arrivals.sql?generation=1751416662934979&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql" -> null
-       output_name         = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2Ffct_stop_time_updates_with_arrivals.sql" -> null
-       source              = "../../../../warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql"] will be destroyed
  # (because key ["models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "ju6RNg==" -> null
-       detect_md5hash      = "7jLymPuY49T8Fj7qPJQ1Vw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752799242610029 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql" -> null
-       md5hash             = "7jLymPuY49T8Fj7qPJQ1Vw==" -> null
-       md5hexhash          = "ee32f298fb98e3d4fc163eea3c943557" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2Ffct_stop_time_updates_with_arrivals_week.sql?generation=1752799242610029&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql" -> null
-       output_name         = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2Ffct_stop_time_updates_with_arrivals_week.sql" -> null
-       source              = "../../../../warehouse/models/mart/gtfs/fct_stop_time_updates_with_arrivals_week.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/int_gtfs_rt__trip_updates_stop_times_with_arrivals.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1Ymikw==" -> (known after apply)
!~      detect_md5hash      = "4rSvwi1uqvTgsvaqF1oBSg==" -> "different hash"
!~      generation          = 1753406561213952 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "4rSvwi1uqvTgsvaqF1oBSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #392](https://github.com/cal-itp/data-infra/actions/runs/16532920944)